<?php
/**
 * Created by JetBrains PhpStorm.
 * User: horsley
 * Date: 13-1-8
 * Time: 下午7:11
 * To change this template use File | Settings | File Templates.
 */

$data_7_4 = new stdClass(); //例7.4的数据

//分类结果
$data_7_4->class = array("Y", "N");

//值域
$data_7_4->values = array(
    "机场起降条件" => array("a1", "a2", "a3"),
    "飞机类型" => array("b1", "b2", "b3"),
    "起降特殊要求" => array("c1", "c2"),
    "天气情况" => array('d1', 'd2', 'd3')
);

//初始属性表
$data_7_4->attrlist = array('机场起降条件', '飞机类型', '起降特殊要求', '天气情况');

//实例集
$data_7_4->instances = array(
    array("机场起降条件" => "a2", "飞机类型" => "b1", "起降特殊要求" => "c1", "天气情况" => "d1", "类别" => "N"),
    array("机场起降条件" => "a2", "飞机类型" => "b1", "起降特殊要求" => "c1", "天气情况" => "d2", "类别" => "N"),
    array("机场起降条件" => "a2", "飞机类型" => "b1", "起降特殊要求" => "c1", "天气情况" => "d3", "类别" => "N"),
    array("机场起降条件" => "a1", "飞机类型" => "b1", "起降特殊要求" => "c1", "天气情况" => "d1", "类别" => "Y"),
    array("机场起降条件" => "a1", "飞机类型" => "b1", "起降特殊要求" => "c1", "天气情况" => "d3", "类别" => "Y"),
    array("机场起降条件" => "a3", "飞机类型" => "b2", "起降特殊要求" => "c1", "天气情况" => "d1", "类别" => "N"),
    array("机场起降条件" => "a3", "飞机类型" => "b2", "起降特殊要求" => "c1", "天气情况" => "d3", "类别" => "N"),
    array("机场起降条件" => "a3", "飞机类型" => "b1", "起降特殊要求" => "c2", "天气情况" => "d1", "类别" => "Y"),
    array("机场起降条件" => "a3", "飞机类型" => "b3", "起降特殊要求" => "c2", "天气情况" => "d3", "类别" => "N"),
    array("机场起降条件" => "a3", "飞机类型" => "b1", "起降特殊要求" => "c2", "天气情况" => "d2", "类别" => "N"),
    array("机场起降条件" => "a1", "飞机类型" => "b3", "起降特殊要求" => "c2", "天气情况" => "d2", "类别" => "Y"),
    array("机场起降条件" => "a1", "飞机类型" => "b3", "起降特殊要求" => "c2", "天气情况" => "d3", "类别" => "Y"),
    array("机场起降条件" => "a2", "飞机类型" => "b2", "起降特殊要求" => "c1", "天气情况" => "d1", "类别" => "N"),
    array("机场起降条件" => "a2", "飞机类型" => "b2", "起降特殊要求" => "c1", "天气情况" => "d3", "类别" => "N"),
    array("机场起降条件" => "a2", "飞机类型" => "b3", "起降特殊要求" => "c2", "天气情况" => "d1", "类别" => "Y"),
    array("机场起降条件" => "a2", "飞机类型" => "b3", "起降特殊要求" => "c2", "天气情况" => "d3", "类别" => "Y"),
    array("机场起降条件" => "a3", "飞机类型" => "b2", "起降特殊要求" => "c2", "天气情况" => "d1", "类别" => "N"),
    array("机场起降条件" => "a3", "飞机类型" => "b2", "起降特殊要求" => "c2", "天气情况" => "d3", "类别" => "N"),
    array("机场起降条件" => "a2", "飞机类型" => "b2", "起降特殊要求" => "c2", "天气情况" => "d3", "类别" => "Y"),
    array("机场起降条件" => "a2", "飞机类型" => "b2", "起降特殊要求" => "c2", "天气情况" => "d2", "类别" => "Y"),
    array("机场起降条件" => "a1", "飞机类型" => "b2", "起降特殊要求" => "c1", "天气情况" => "d2", "类别" => "Y"),
    array("机场起降条件" => "a1", "飞机类型" => "b2", "起降特殊要求" => "c1", "天气情况" => "d3", "类别" => "Y"),
    array("机场起降条件" => "a1", "飞机类型" => "b1", "起降特殊要求" => "c2", "天气情况" => "d1", "类别" => "Y"),
    array("机场起降条件" => "a3", "飞机类型" => "b2", "起降特殊要求" => "c1", "天气情况" => "d2", "类别" => "N")
);

return $data_7_4;